Repository: gentpan/CLIState
Catalog: App/Resources/Restore.xcstrings
Source language: en
Languages: zh_hans

source: %@ couldn't be installed because %@ returned an error. View the output for details.
zh_hans: %1$@ 安装失败：%2$@ 返回了错误。查看输出了解详情。

source: %@ isn't a CLI State environment profile.
zh_hans: %@ 不是 CLI State 环境配置文件。

source: %@ isn't installed
zh_hans: 未安装 %@

source: %@ via %@
zh_hans: %1$@（通过 %2$@）

source: %@ via %@, was %@
zh_hans: %1$@（通过 %2$@），原为 %3$@

source: %lld of %lld selected
zh_hans: 已选 %1$lld / %2$lld 项

source: %lld packages
zh_hans: %lld 个软件包

source: %lld selected to install
zh_hans: 已选 %lld 项待安装

source: AI CLI Toolkit
zh_hans: AI CLI 工具包

source: AI Suggestion
zh_hans: AI 建议

source: AI only picks from CLI State's list of known tools. It never writes commands, and nothing is installed until you review the checklist and confirm.
zh_hans: AI 只会从 CLI State 已知的工具清单里挑选，不会编写任何命令；在你核对清单并确认之前，什么都不会安装。

source: Already installed (%lld)
zh_hans: 已安装（%lld）

source: CLI State didn't find packages you installed yourself with a supported package manager.
zh_hans: 没有找到你通过受支持的包管理器主动安装的软件包。

source: CLI State runs the commands below, then rescans to confirm each package is installed. Packages that are already installed aren't upgraded.
zh_hans: CLI State 会运行下面的命令，然后重新扫描，确认每个软件包都已装好。已经安装的软件包不会被升级。

source: Can't Install
zh_hans: 无法安装

source: Cancel
zh_hans: 取消

source: Choose a .clistate-profile.json file saved on another Mac. CLI State compares it with this Mac before anything is installed.
zh_hans: 选择在另一台 Mac 上保存的 .clistate-profile.json 文件。安装任何东西之前，CLI State 会先把它和这台 Mac 做对比。

source: Claude Code, Codex, Gemini CLI, opencode and Aider, with Node.js and uv.
zh_hans: Claude Code、Codex、Gemini CLI、opencode 和 Aider，附带 Node.js 与 uv。

source: Command finished, but the rescan didn't find every package
zh_hans: 命令已完成，但重新扫描没有找到全部软件包

source: Copied
zh_hans: 已复制

source: Copy
zh_hans: 复制

source: Couldn't Open the Profile
zh_hans: 无法打开配置文件

source: Couldn't Prepare the Installation
zh_hans: 无法准备安装

source: Couldn't Save the Brewfile
zh_hans: 无法保存 Brewfile

source: Couldn't Save the Profile
zh_hans: 无法保存配置文件

source: Curated sets of well-known tools. Pick one, review the checklist, then install what's missing.
zh_hans: 精选的常用工具组合。选一个模板，核对清单，再安装缺少的部分。

source: Deselect All
zh_hans: 全不选

source: DevOps & Cloud
zh_hans: 运维 / 云

source: Don't ask again for %@
zh_hans: 对 %@ 不再询问

source: Environment Restore
zh_hans: 环境迁移

source: Export Brewfile…
zh_hans: 导出 Brewfile…

source: Export This Mac
zh_hans: 导出当前环境

source: For example: a React front end and a Go API with PostgreSQL
zh_hans: 例如：React 前端，加上用 PostgreSQL 的 Go API

source: For your information only. CLI State doesn't upgrade or downgrade these here.
zh_hans: 仅供参考。CLI State 不会在这里升级或降级它们。

source: Frontend Web
zh_hans: 前端 Web

source: Go Backend
zh_hans: Go 后端

source: Go with gopls and golangci-lint, PostgreSQL and Redis.
zh_hans: Go 与 gopls、golangci-lint，外加 PostgreSQL 和 Redis。

source: Homebrew runs first, so runtimes exist before npm, uv, pipx and Cargo need them. Nothing runs until you confirm.
zh_hans: 先运行 Homebrew，让 npm、uv、pipx 和 Cargo 用到的运行时先装好。确认之前不会运行任何命令。

source: Import from File
zh_hans: 从文件导入

source: Install
zh_hans: 安装

source: Install %@
zh_hans: 安装 %@

source: Install %@ first, then refresh.
zh_hans: 先安装 %@，然后刷新。

source: Install %lld Tools
zh_hans: 安装 %lld 个工具

source: Install %lld tools
zh_hans: 安装 %lld 个工具

source: Install Homebrew yourself by running this command in Terminal, then refresh. CLI State never runs it for you.
zh_hans: 请自己在“终端”里运行这条命令安装 Homebrew，然后刷新。CLI State 不会替你运行它。

source: Install Rust first (Homebrew's rust, or rustup followed by `rustup default stable`), then refresh.
zh_hans: 先安装 Rust（Homebrew 的 rust，或 rustup 后再运行 `rustup default stable`），然后刷新。

source: Install Selected…
zh_hans: 安装所选…

source: Install pipx first (for example with Homebrew), then refresh.
zh_hans: 先安装 pipx（例如用 Homebrew），然后刷新。

source: Install pnpm first, then run `pnpm setup` in Terminal and refresh.
zh_hans: 先安装 pnpm，在“终端”里运行 `pnpm setup`，然后刷新。

source: Install uv first (for example with Homebrew), then refresh.
zh_hans: 先安装 uv（例如用 Homebrew），然后刷新。

source: Installed
zh_hans: 已安装

source: Installed %lld tools
zh_hans: 已安装 %lld 个工具

source: Installs with %@ after %@
zh_hans: 等 %2$@ 装好后用 %1$@ 安装

source: My Mac
zh_hans: 我的 Mac

source: Name
zh_hans: 名称

source: Node.js Full Stack
zh_hans: Node 全栈

source: Node.js and pnpm with PostgreSQL, Redis and jq.
zh_hans: Node.js 与 pnpm，外加 PostgreSQL、Redis 和 jq。

source: Node.js with pnpm and Yarn, Deno, Git and GitHub CLI.
zh_hans: Node.js 与 pnpm、Yarn，外加 Deno、Git 和 GitHub CLI。

source: Note
zh_hans: 备注

source: Nothing to export
zh_hans: 没有可导出的内容

source: Only packages you installed yourself through Homebrew, npm, pnpm, uv, pipx or Cargo are included. Dependencies, system tools, paths, environment variables and secrets never are.
zh_hans: 只包含你通过 Homebrew、npm、pnpm、uv、pipx 或 Cargo 主动安装的软件包。依赖项、系统自带工具、路径、环境变量和密钥一律不会写入。

source: Only your description and CLI State's list of known tools are sent. Nothing about this Mac is included.
zh_hans: 只会发送你的描述和 CLI State 的已知工具清单，不包含这台 Mac 的任何信息。

source: Open AI Settings…
zh_hans: 打开 AI 设置…

source: Open Another…
zh_hans: 打开其他文件…

source: Open Profile…
zh_hans: 打开配置文件…

source: Open an Environment Profile
zh_hans: 打开环境配置文件

source: Optional
zh_hans: 可选

source: PHP and Composer with MySQL, Redis, nginx and Node.js.
zh_hans: PHP 与 Composer，外加 MySQL、Redis、nginx 和 Node.js。

source: Pinned
zh_hans: 已锁定版本

source: Python & Data
zh_hans: Python / 数据

source: Python with uv, Ruff, JupyterLab, DuckDB and SQLite.
zh_hans: Python 与 uv、Ruff、JupyterLab，外加 DuckDB 和 SQLite。

source: Reading the latest scan…
zh_hans: 正在读取最近一次扫描…

source: Rust with rust-analyzer, cargo-nextest and ripgrep.
zh_hans: Rust 与 rust-analyzer、cargo-nextest，外加 ripgrep。

source: Save Profile…
zh_hans: 保存配置文件…

source: Save what's installed on this Mac
zh_hans: 保存这台 Mac 上安装的工具

source: Saved by a newer CLI State. Items this version doesn't understand are shown as Can't Install.
zh_hans: 该文件由更新版本的 CLI State 保存。当前版本无法识别的条目会显示为“无法安装”。

source: Select All
zh_hans: 全选

source: Send
zh_hans: 发送

source: Send to %@?
zh_hans: 发送给 %@？

source: Set up AI in Settings › AI to get suggestions.
zh_hans: 在“设置 › AI”中配置后即可获得建议。

source: Show Suggestion
zh_hans: 显示建议

source: Show exactly what's sent
zh_hans: 查看将要发送的完整内容

source: Start from a template
zh_hans: 从模板开始

source: Step %lld is running. CLI State continues with %@ after the rescan.
zh_hans: 正在进行第 %1$lld 步。重新扫描后，CLI State 会继续安装 %2$@ 的软件包。

source: Stop
zh_hans: 停止

source: Stop After This Step
zh_hans: 这一步后停止

source: Suggest
zh_hans: 生成建议

source: Suggested %lld tools. Review the checklist below.
zh_hans: 建议了 %lld 个工具，请在下方核对清单。

source: Templates
zh_hans: 模板

source: The answer didn't name any tool CLI State can install. Try describing your work differently.
zh_hans: 回答里没有 CLI State 能安装的工具。换个方式描述你的工作再试试。

source: The package name isn't valid, so it's skipped
zh_hans: 软件包名称无效，已跳过

source: Thinking…
zh_hans: 正在思考…

source: This version of CLI State can't install with %@
zh_hans: 当前版本的 CLI State 不支持用 %@ 安装

source: To Install
zh_hans: 待安装

source: Version Differs
zh_hans: 版本不同

source: Via %@
zh_hans: 通过 %@

source: Waiting
zh_hans: 等待中

source: What do you mainly develop?
zh_hans: 你主要开发什么？

source: kubectl, Helm, k9s, Terraform and the AWS CLI.
zh_hans: kubectl、Helm、k9s、Terraform 和 AWS CLI。

source: npm comes with Node.js. Install Node.js first (for example Homebrew's node), then refresh.
zh_hans: npm 随 Node.js 一起提供。先安装 Node.js（例如 Homebrew 的 node），然后刷新。

source: tap, brew and cask lines for `brew bundle`
zh_hans: 供 `brew bundle` 使用的 tap、brew 和 cask 行

# tool.summary.awscli
source: Command-line interface for Amazon Web Services.
zh_hans: Amazon Web Services 的命令行工具。

# tool.summary.cargo-nextest
source: Next-generation test runner for Rust.
zh_hans: 新一代 Rust 测试运行器。

# tool.summary.cocoapods
source: Dependency manager for Swift and Objective-C projects.
zh_hans: Swift 和 Objective-C 项目的依赖管理器。

# tool.summary.duckdb
source: In-process analytical SQL database.
zh_hans: 进程内运行的分析型 SQL 数据库。

# tool.summary.fastlane
source: Automate building and releasing iOS and macOS apps.
zh_hans: 自动化构建和发布 iOS 与 macOS 应用。

# tool.summary.golangci-lint
source: Fast linters runner for Go.
zh_hans: 快速运行多种 Go 代码检查器的工具。

# tool.summary.gopls
source: Official Go language server for editors.
zh_hans: Go 官方的编辑器语言服务器。

# tool.summary.helm
source: Package manager for Kubernetes.
zh_hans: Kubernetes 的包管理器。

# tool.summary.jupyterlab
source: Web-based notebooks for data science and scientific computing.
zh_hans: 用于数据科学和科学计算的网页版笔记本。

# tool.summary.k9s
source: Terminal UI for managing Kubernetes clusters.
zh_hans: 在终端里管理 Kubernetes 集群的界面。

# tool.summary.kubectl
source: Command-line tool for Kubernetes clusters.
zh_hans: 管理 Kubernetes 集群的命令行工具。

# tool.summary.ruff
source: Extremely fast Python linter and code formatter.
zh_hans: 速度极快的 Python 代码检查与格式化工具。

# tool.summary.rust-analyzer
source: Language server for Rust.
zh_hans: Rust 的语言服务器。

# tool.summary.swiftformat
source: Code formatter for Swift.
zh_hans: Swift 代码格式化工具。

# tool.summary.swiftlint
source: Enforce Swift style and conventions.
zh_hans: 检查 Swift 代码风格与规范。

# tool.summary.terraform
source: Infrastructure as code from HashiCorp.
zh_hans: HashiCorp 出品的基础设施即代码工具。

# tool.summary.xcbeautify
source: Readable output for xcodebuild.
zh_hans: 让 xcodebuild 的输出更易读。

# tool.summary.xcodes
source: Install and switch between Xcode versions.
zh_hans: 安装并切换不同版本的 Xcode。

source: xcodes, SwiftLint, SwiftFormat, xcbeautify, CocoaPods and fastlane.
zh_hans: xcodes、SwiftLint、SwiftFormat、xcbeautify、CocoaPods 和 fastlane。
